gitBranching.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Git Branching</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Git Branching"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-08-25T18:39-0400"/>
<meta name="author" content="pawel"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Git Branching</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Git Branching - What a Branch Is</a>
<ul>
<li><a href="#sec-1-1">1.1 What a Branch is</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Basic Branching and Merging</a>
<ul>
<li><a href="#sec-2-1">2.1 Basic Branching</a></li>
<li><a href="#sec-2-2">2.2 Basic Merging</a></li>
<li><a href="#sec-2-3">2.3 Basic Merge Conflicts</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Branch Management</a>
<ul>
<li><a href="#sec-3-1">3.1 Branch Management</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Branching Workflows</a>
<ul>
<li><a href="#sec-4-1">4.1 Long Running Branches</a></li>
<li><a href="#sec-4-2">4.2 Topic Branches</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Remote Branches</a>
<ul>
<li><a href="#sec-5-1">5.1 Remote Branches</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Git Branching - What a Branch Is</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What a Branch is</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>When you stage files, git will checksum each file, store that
  version of the file in the git repository, and add the checksum to
  the <a href="gettingStarted.html">staging area</a>
</li>
<li>When you commit, git will 
<ol>
<li>checksum all project directories and store them as tree objects
     in the git repository. The tree object lists the contents of
     directory and specifies which files names are stored as which
     blobs.
</li>
<li>create a commit object that contains metadata about the commit
     (e.g. commit date, author, etc.), a pointer to a tree object
     that corresponds to the root project directory, and if there is
     a previous commit, a pointer to that commit object.
</li>
</ol>

</li>
<li>A branch is a movable pointer that points to a commit object
</li>
<li>The default branch is the "master" branch
</li>
<li>Everytime you commit the master branch pointer is automatically moved
  forward to the latest commit
</li>
<li>To create a new branch:
</li>
</ul>




<pre class="example">git branch testing
</pre>

<ul>
<li>The above will create a new pointer "testing", which will point to
  the last commit object
</li>
<li>The above command does not switch to the new branch
</li>
<li>How does git know which branch you're on?
<ul>
<li>It keeps a special pointer called "HEAD" - it points to the
    branch pointer
</li>
</ul>

</li>
<li>To switch to the new branch:
</li>
</ul>




<pre class="example">git checkout testing
</pre>

<ul>
<li>The "HEAD" pointer now points to the testing pointer
</li>
<li>Now when you commit, the testing pointer will point to the new
  commit object while the master pointer will point to the previous
  commit
</li>
<li>When you switch back and make a new commit:
</li>
</ul>




<pre class="example">git checkout master
git commit -a -m 'a commit to master branch'
</pre>

<ul>
<li>After git checkout, two things happen:
<ol>
<li>"HEAD" points to master pointer
</li>
<li>The files in your working directory have been reverted to the
      snapshot that master points to.
</li>
</ol>

</li>
<li>Once you commit, the branches diverge
</li>
<li>Creating a branch is quick and simple and therefore is encouraged
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Basic Branching and Merging</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Basic Branching</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>An example scenario:
<ol>
<li>You have a production branch on your local system
</li>
<li>You have to work on issue 53
</li>
<li>You get a call that says you must fix a bug
</li>
<li>After the bug is fixed, 
</li>
</ol>

</li>
<li>To accomplish the above in git:
</li>
<li>First create a branch and switch to it (-b flag):
</li>
</ul>




<pre class="example">git checkout -b &lt;branchName&gt;
git checkout -b iss53
</pre>

<ul>
<li>Now switch back to master branch, but note that if your working
  directory or staging area have uncommitted changes, Git won't let
  you switch
</li>
</ul>




<pre class="example">git checkout master
</pre>

<ul>
<li>The above has reset your working directory to look like the
  snapshot before you branched
</li>
<li>Now create a branch to work on for the hotfix:
</li>
</ul>




<pre class="example">git checkout -b hotfix
</pre>

<ul>
<li>Once you've committed your changes to the hotfix branch, you must
  merge them back to the production branch:
</li>
</ul>




<pre class="example">git checkout master
git merge hotfix
</pre>

<ul>
<li>in this case, the git merge command will move the master pointer
  forward because the branch was directly upstream. This is called a
  "fast forward"
</li>
<li>now you can delete the hotfix branch:
</li>
</ul>




<pre class="example">git branch -d hotfix
</pre>

<ul>
<li>switch to issue 53 branch:
</li>
</ul>




<pre class="example">git checkout iss53
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Basic Merging</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>Once you've finished working on issue 53, you have to merge it back
  to the master branch:
</li>
</ul>




<pre class="example">git checkout master
git merge iss53
</pre>

<ul>
<li>Since the master and iss53 branches are not on the same stream,
  they are merged using a three-way merge:
<ol>
<li>It will use the two snapshots that you want to merge plus their
     common ancestor
</li>
<li>Git will create a new commit based on the merger, which master
     will point to (known as a merge commit)
</li>
</ol>

</li>
<li>The new commit will have two pointers that will point to the last
  commit from the previous two branches
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Basic Merge Conflicts</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li>If the same file is modified from two different branches a conflict
  will result if you try to merge the two branches. The merge will
  fail.
</li>
<li>git status will show you conflicts
</li>
<li>The conflicting files will have standard conflict markers
</li>
<li>Once the conflicts have been resolved, you use git commit to
  finalize the merge commit
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Branch Management</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Branch Management</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>To list branches:
</li>
</ul>




<pre class="example">git branch
</pre>

<ul>
<li>The star character next to the branch listings indicated the
  current branch
</li>
<li>To see last commit on each branch:
</li>
</ul>




<pre class="example">git branch -v
</pre>

<ul>
<li>To see branches that are merged/not-merged into your current branch:
</li>
</ul>




<pre class="example">git branch --merged
git branch --no-merged
</pre>

<ul>
<li>You can't delete a branch that is not merged. Unless you specify
  the -D flag
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Branching Workflows</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Long Running Branches</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>One possible workflow is to have multiple branches.
</li>
<li>One branch is the stable branch - ready for release
</li>
<li>The next branch is unstable and the branch after it is even more
  unstable
</li>
<li>As you develop, you merge the less stable merges with the more
  stable branches
</li>
<li>Useful for complex projects
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Topic Branches</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>A short lived branch useful for one particular feature. 
</li>
<li>See example above with iss53
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Remote Branches</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Remote Branches</h3>
<div class="outline-text-3" id="text-5-1">

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-08-25T18:39-0400</p>
<p class="author">Author: pawel</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
